Revit 2024 API
AssemblyViewUtils.CreatePartList Method
Overload List
Name | Description
CreatePartList(Document, ElementId)
 Creates a new part list multicategory schedule assembly view for the assembly instance.
CreatePartList(Document, ElementId, ElementId, Boolean)
 Creates a new part list multicategory schedule assembly view for the assembly instance.
See Also
AssemblyViewUtils Class
AssemblyViewUtils Members
Autodesk.Revit.DB Namespace